function setup() {
  createCanvas(500, 850);
}

function draw() {
  // 하늘 색 2가지, 기내 회색
  background(10, 50, 105);
  noStroke();
  fill(18, 100, 185);
  rect(0, 230, 500, 240);
  fill(8, 20, 40);
  rect(0, 470, 500, 380);
  // 중간의 밝은 부분 선
  fill(190, 225, 245);
  rect(0, 455, 500, 12);
  // 아래쪽 하늘 덧그리기
  noStroke();
  fill(75, 170, 240);
  arc(250, 470, 620, 520, 0, 3.14);
  // 엔진
  stroke(145, 170, 195);
  strokeWeight(2);
  fill(205, 220, 232);
  ellipse(350, 440, 125, 55);
  fill(145, 170, 195);
  ellipse(390, 440, 42, 38);
  // 비행기 날개
  fill(225, 235, 242);
  stroke(145, 170, 190);
  strokeWeight(1);
  quad(55, 300, 500, 380, 500, 455, 145, 355);
  // 날개 위의 선
  stroke(125, 150, 175);
  line(150, 350, 500, 415);
  line(150, 350, 500, 440);
  // 날개 끝 노랑, 빨강, 파랑
  fill(245, 220, 20);
  triangle(55, 300, 105, 345, 95, 315);
  fill(235, 25, 60);
  triangle(85, 305, 150, 355, 105, 345);
  fill(55, 65, 150);
  triangle(105, 345, 125, 350, 85, 325);
  // 창문 테두리. 회색, 검정
  noFill();
  stroke(75, 90, 110);
  strokeWeight(30);
  arc(250, 510, 620, 520, 0, 3.14);
  stroke(5, 15, 30);
  strokeWeight(8);
  arc(250, 510, 620, 520, 0, 3.14);
}